docs/posts/2015-06-23-emacs-on-os-x.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs on OS X</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Emacs on OS X</h1>
<p class="subtitle" role="doc-subtitle">Jun 23, 2015</p>
</header><section id="outline-container-orgdd78e61" class="outline-2">
<h2 id="orgdd78e61">Homebrew</h2>
<div class="outline-text-2" id="text-orgdd78e61">
<p>
I install Emacs with <a href="http://brew.sh">Homebrew</a>. After installing Homebrew, just type the following in Terminal:
</p>

<p>
<code>brew install emacs --cocoa</code>
</p>

<p>
This makes upgrading very easy, `brew upgrade` updates everything that you&rsquo;ve installed in Homebrew. It also keeps things nicely organized in <i>usr/local/Cellar</i> and puts symbolic links in <i>usr/local/bin</i>. After installation, you have two options for getting Emacs into your Applications directory. First, Homebrew can put a link there with `brew linkapps Emacs`. Second, you can copy Emacs to /Applications with
</p>

<p>
<code>cp -r /usr/local/Cellar/emacs/24.5/Emacs.app /Applications/</code>
</p>
</div>
</section>
<section id="outline-container-org7b180c9" class="outline-2">
<h2 id="org7b180c9">Prelude</h2>
<div class="outline-text-2" id="text-org7b180c9">
<p>
I use <a href="http://batsov.com/prelude/">Emacs Prelude</a>, a starter kit by Bozhidar Batsov. There are many Emacs users that advocate setting up your own configuration from scratch, and I&rsquo;ve done that many times. I keep coming back to Prelude, though, it just makes the initial work so much easier. Prelude includes a personal directory for individual configuration files. I keep all of those files in a git repository located in Dropbox with symbolic links in the Prelude personal directory. That way, I can use Github for version control, but have all machines in sync with no effort.
</p>

<p>
There are two important files in my personal directory. The first is an emacs-lisp file containing this:
</p>


<pre class="example" id="org2b87380">
;;Load emacs personal settings via org
(prelude-require-package 'org)
(org-babel-load-file
(expand-file-name "personal/settings.org" user-emacs-directory))
</pre>

<p>
This file loads an org-mode file that contains the actual configuration.
</p>
</div>
</section>
<section id="outline-container-org9bf9010" class="outline-2">
<h2 id="org9bf9010">Starting Emacs</h2>
<div class="outline-text-2" id="text-org9bf9010">
<p>
I like to start Emacs using the daemon, which keeps an Emacs server running in the background, then connect to that server with Emacs Client. This makes opening Emacs nearly instantaneous.
</p>

<p>
In the past, I&rsquo;ve done this from the terminal by putting with these aliases in my zshrc:
</p>


<ul class="org-ul">
<li><code>alias daemon</code>&ldquo;emacs &#x2013;daemon&rdquo;=</li>
<li><code>alias ec</code>&ldquo;emacsclient -c -a &lsquo;&rsquo;&rdquo;=</li>
<li><code>alias ef</code>&ldquo;emacsclient -c -a &lsquo;&rsquo; -F &rsquo;((fullscreen . maximized))&rsquo;&rdquo;=</li>
<li><code>alias e</code>&ldquo;emacsclient -t&rdquo;=</li>
</ul>

<p>
The first simply starts the server. I never used it, because the second would connect to the server one were already running, otherwise, it would start one, then connect to it. The third does the same thing, but starts an Emacs client with a maximized frame.
</p>

<p>
This worked well, but I usually use Alfred to start applications, not the terminal. After trying many options, I ran across these instructions by <a href="http://blog.haberkucharsky.com/tech/2015/01/26/emacs-on-osx.html%20">Jesse Haber-Kucharsky</a>. I created the Emacs Daemon application with one change, instead of using Emacs in <i>Applications, I had the script point directly to /usr/local/bin</i> instead. I created the three shell scripts as directed, but instead of the Emacs-Cocoa application, I created one called &ldquo;Emacs Client&rdquo; that started the &ldquo;ec&rdquo; script. The daemon runs at startup, then I call Emacs Client from Alfred whenever I want to start Emacs.
</p>

<p>
There are parts of this that I really didn&rsquo;t need to do, but too much is better than not enough, I suppose.
</p>


<div class="tagline" id="org03c395b">
<p>
Tagged: <a href="../tags/emacs.html">Emacs</a>
</p>

</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
